###################################################################

# Created by write_sdc on Wed Dec 4 03:36:28 2024

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -max_library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -min scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -min_library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c
set_wire_load_model -name tsmc13_wl30 -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports i_sensor_1_1]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports i_sensor_1_5]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports i_sensor_2_1]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports i_sensor_2_5]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports i_sensor_3_1]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports i_sensor_3_5]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports i_sensor_4_1]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports i_sensor_4_5]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports SI]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports SE]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports test_mode]
set_load -pin_load 0.5 [get_ports SO]
set_load -pin_load 0.5 [get_ports LED_RED_1]
set_load -pin_load 0.5 [get_ports LED_RED_2]
set_load -pin_load 0.5 [get_ports LED_RED_3]
set_load -pin_load 0.5 [get_ports LED_RED_4]
set_load -pin_load 0.5 [get_ports LED_GREEN_1]
set_load -pin_load 0.5 [get_ports LED_GREEN_2]
set_load -pin_load 0.5 [get_ports LED_GREEN_3]
set_load -pin_load 0.5 [get_ports LED_GREEN_4]
set_load -pin_load 0.5 [get_ports LED_YELLOW_1]
set_load -pin_load 0.5 [get_ports LED_YELLOW_2]
set_load -pin_load 0.5 [get_ports LED_YELLOW_3]
set_load -pin_load 0.5 [get_ports LED_YELLOW_4]
set_case_analysis 1 [get_ports test_mode]
set_case_analysis 0 [get_ports SE]
create_clock [get_ports clk]  -name CLK  -period 50  -waveform {0 25}
set_clock_uncertainty -setup 0.2  [get_clocks CLK]
set_clock_uncertainty -hold 0.1  [get_clocks CLK]
create_clock [get_ports scan_clk]  -name DFTCLK  -period 200  -waveform {0 100}
set_clock_latency 0  [get_clocks DFTCLK]
set_clock_uncertainty -setup 0.2  [get_clocks DFTCLK]
set_clock_uncertainty -hold 0.1  [get_clocks DFTCLK]
set_clock_transition -min -fall 0.05 [get_clocks DFTCLK]
set_clock_transition -max -fall 0.05 [get_clocks DFTCLK]
set_clock_transition -min -rise 0.05 [get_clocks DFTCLK]
set_clock_transition -max -rise 0.05 [get_clocks DFTCLK]
set_input_delay -clock CLK  10  [get_ports i_sensor_1_1]
set_input_delay -clock CLK  10  [get_ports i_sensor_1_5]
set_input_delay -clock CLK  10  [get_ports i_sensor_2_1]
set_input_delay -clock CLK  10  [get_ports i_sensor_2_5]
set_input_delay -clock CLK  10  [get_ports i_sensor_3_1]
set_input_delay -clock CLK  10  [get_ports i_sensor_3_5]
set_input_delay -clock CLK  10  [get_ports i_sensor_4_1]
set_input_delay -clock CLK  10  [get_ports i_sensor_4_5]
set_input_delay -clock DFTCLK  40  [get_ports test_mode]
set_input_delay -clock DFTCLK  40  [get_ports SI]
set_input_delay -clock DFTCLK  40  [get_ports SE]
set_output_delay -clock CLK  10  [get_ports LED_RED_1]
set_output_delay -clock CLK  10  [get_ports LED_RED_2]
set_output_delay -clock CLK  10  [get_ports LED_RED_3]
set_output_delay -clock CLK  10  [get_ports LED_RED_4]
set_output_delay -clock CLK  10  [get_ports LED_GREEN_1]
set_output_delay -clock CLK  10  [get_ports LED_GREEN_2]
set_output_delay -clock CLK  10  [get_ports LED_GREEN_3]
set_output_delay -clock CLK  10  [get_ports LED_GREEN_4]
set_output_delay -clock CLK  10  [get_ports LED_YELLOW_1]
set_output_delay -clock CLK  10  [get_ports LED_YELLOW_2]
set_output_delay -clock CLK  10  [get_ports LED_YELLOW_3]
set_output_delay -clock CLK  10  [get_ports LED_YELLOW_4]
set_output_delay -clock DFTCLK  40  [get_ports SO]
