#@ # 
#@ # Running fm_shell Version L-2016.03-SP1 for linux64 -- Apr 13, 2016
#@ # Date:   Wed Dec  4 03:12:39 2024
#@ # Run by: IC@IC
#@ 

source /opt/Synopsys/Formality2016/admin/setup/.synopsys_fm.setup
#@ # -- Starting source /opt/Synopsys/Formality2016/admin/setup/.synopsys_fm.setup

#@ #
#@ # .synopsys_fm.setup: Initialization File for Formality
#@ #
#@ 
#@ 
#@ #
#@ # Enable stack trace output on fatal.  Not available for all architectures.
#@ #
#@ if { $sh_arch == "sparc" || $sh_arch == "sparcOS5" ||      $sh_arch == "hp700" || $sh_arch == "hpux10" } {
#@   set_unix_variable SYNOPSYS_TRACE ""
#@ }
#@ 
#@ #
#@ # Variable settings
#@ #
#@ set sh_new_variable_message true
#@ 
#@ #
#@ # Synopsys strongly recommends that you uncomment the following command
#@ # in order to set sh_command_abbrev_mode to the value "Command-Line-Only".
#@ # Command abbreviation is intended as an interactive convenience.  Using
#@ # abbreviations in scripts can cause commands to fail in subsequent releases.
#@ # 
#@ #set sh_command_abbrev_mode "Command-Line-Only"
#@ 
#@ #
#@ # Some useful aliases
#@ #
#@ alias list_commands		help
#@ 
#@ #
#@ # The alias of q to quit is commented out.  Remove the comment 
#@ # character if you want this alias.  Some users find that having 
#@ # this particular alias causes problems when mixed with page-mode
#@ # for reports - an accidental repeated 'q' not only cancels the
#@ # output but exits the tool.
#@ #
#@ #alias q quit
#@ # -- End source /opt/Synopsys/Formality2016/admin/setup/.synopsys_fm.setup

set_svf -append { /home/IC/ASIC/Synthesis/DFT/netlist.svf } 
read_verilog -container r -libname WORK -05 { /home/IC/ASIC/Synthesis/rtl/actuator.v /home/IC/ASIC/Synthesis/rtl/counter.v /home/IC/ASIC/Synthesis/rtl/top_module.v /home/IC/ASIC/Synthesis/rtl/traffic_lights.v } 
read_db { /home/IC/ASIC/Synthesis/std_cells/scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c.db /home/IC/ASIC/Synthesis/std_cells/scmetro_tsmc_cl013g_rvt_ss_1p08v_125c.db /home/IC/ASIC/Synthesis/std_cells/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db } 
set_top r:/WORK/top_module 
read_verilog -container i -libname WORK -05 { /home/IC/ASIC/Synthesis/DFT/sys_dft.v } 
read_db { /home/IC/ASIC/Synthesis/std_cells/scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c.db /home/IC/ASIC/Synthesis/std_cells/scmetro_tsmc_cl013g_rvt_ss_1p08v_125c.db /home/IC/ASIC/Synthesis/std_cells/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db } 
set_top i:/WORK/top_module 
match 
verify 
set_dont_verify_points -type port Ref:/WORK/*/SI
set_dont_verify_points -type port r:/WORK/top_module/SI
set_dont_verify_points -type port i:/WORK/top_module/SI
set_dont_verify_points -type port i:/WORK/top_module/SO
set_dont_verify_points -type port r:/WORK/top_module/SO
match 
set_constant r:/WORK/top_module/test_mode 0
set_constant r:/WORK/top_module/test_mode 0
setup
set_constant r:/WORK/top_module/test_mode 0
set_constant i:/WORK/top_module/test_mode 0
set_constant i:/WORK/top_module/SE 0
set_constant r:/WORK/top_module/SE 0
match 
verify 
match 
